app/controllers/orders_controller.rb

  def create
    amount = params[:stripeAmount].to_i * 100
    service = Service.find(params[:service_id])
    # Create the customer in Stripe
    customer = Stripe::Customer.create(
      email: params[:stripeEmail],
      card: params[:stripeToken]
    )
    # Create the charge using the customer data returned by Stripe API
    charge = Stripe::Charge.create(
      customer: customer.id,
      amount: amount,
      description: 'Rails Stripe customer',
      currency: 'usd'
    )
    order = current_user.orders.new(order_params)
    order.total_price = order.price.to_i * order.quantity.to_i
    order.save!
---
SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "orders" ("quantity", "price", "service_id", "user_id", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["quantity", 1], ["price", 1000], ["service_id", 1], ["user_id", 1], ["total_price", 1000], ["created_at", "2017-02-13 09:11:43.498865"], ["updated_at", "2017-02-13 09:11:43.498865"]]