app/controllers/pages_controller.rb

SELECT  "services".* FROM "services" WHERE "services"."user_id" = ?  ORDER BY "services"."created_at" DESC LIMIT 2  [["user_id", 2]]
---
  def home
  	if current_user.present?
  		@services = current_user.services.order(created_at: :desc).limit(2)