app/controllers/services_controller.rb

SELECT "services".* FROM "services" WHERE "services"."user_id" = ?  [["user_id", 1]]
---
  def index
    @services = current_user.services if current_user.services.present?

INSERT INTO "services" ("title", "description", "price", "requirements", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "test"], ["description", "test"], ["price", 500], ["requirements", "test"], ["user_id", 2], ["created_at", "2017-03-01 12:21:55.148443"], ["updated_at", "2017-03-01 12:21:55.148443"]]
---
  def create
    # TODO: Save the newly created service. Redirect to an appropriate page if save fails.
    @user = current_user
    @service = @user.services.new(service_params)
    respond_to do |format|
      if @service.save

UPDATE "services" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "services"."id" = ?  [["image_file_name", "7024263-3d-black-white-pictures.jpg"], ["image_file_size", 531078], ["image_updated_at", "2017-03-01 12:26:15.707743"], ["updated_at", "2017-03-01 12:26:16.046633"], ["id", 4]]
---
  def update
    # TODO: Save the updated service. Redirect to an appropriate page if save fails.
    respond_to do |format|
      if @service.update(service_params)